ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_analog_subsys_regs.xml
<module id="ANALOG_SUBSYS_REGS" HW_revision="" description="ANALOG SUBSYS Registers">
	<register id="PMMVREGTRIM" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="Power Management Module VREG Trim Register">
		<bitfield id="VREGTRIM" description="Core VDD Voltage Regulator Trim" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="CTLTRIMSTS" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="HWCTL TRIM Error Status register">
		<bitfield id="CTLSTS" description="TRIM Load Complete" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SBERR" description="Single-bit error detected while reading from Flash" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SCANERR" description="Wrong scan chain signature" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="TWOBERR" description="Two-bit error detected" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="TIMEOUT" description="Timeout Error" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="INVKEY1" description="Invalid key read during TLC1" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="INVKEY2" description="Invalid key read during TLC2" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="INVKEY3" description="Invalid key read during TLC3" begin="18" end="18" width="1" rwaccess="R"/>
	</register>
	<register id="REFBUFCONFIGCDE" width="32" page="0" offset="0x154" instances="1" instaddr="4" internal="0" description="Config register for analog reference CDE">
		<bitfield id="ADCC_LSB_RES_DAMP" description="ADCC LSB damp res prog" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="ADCC_MSB_RES_DAMP" description="ADCC MSB damp res prog" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="ADCC_CHSEL_SOC_DEL_PROG" description="CHSEL rise to ADCCSOC rise delay program" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCD_LSB_RES_DAMP" description="ADCD LSB damp res prog" begin="6" end="5" width="2" rwaccess="RW"/>
		<bitfield id="ADCD_MSB_RES_DAMP" description="ADCD MSB damp res prog" begin="8" end="7" width="2" rwaccess="RW"/>
		<bitfield id="ADCD_CHSEL_SOC_DEL_PROG" description="CHSEL rise to ADCDSOC rise delay program" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ADCE_LSB_RES_DAMP" description="ADCE LSB damp res prog" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="ADCE_MSB_RES_DAMP" description="ADCE MSB damp res prog" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="ADCE_CHSEL_SOC_DEL_PROG" description="CHSEL rise to ADCESOC rise delay program" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_TM_ENZ_DUTY_CYCLE" description="Disable Pulse Stretch testmode to have effect in ADC_CLK" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="DIS_ADCC_SP_SLEWBOOST" description="ADC sp slew boost disbale" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCDTM_ENZ_DUTY_CYCLE" description="Disable Pulse Stretch testmode to have effect in ADC_CLK" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DIS_ADCD_SP_SLEWBOOST" description="ADC sp slew boost disbale" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ADCE_TM_ENZ_DUTY_CYCLE" description="Disable Pulse Stretch testmode to have effect in ADC_CLK" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="DIS_ADCE_SP_SLEWBOOST" description="ADC sp slew boost disbale" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="Spare1" description="Spare1 bits" begin="31" end="21" width="11" rwaccess="RW"/>
	</register>
	<register id="INTERNALTESTCTL" width="32" page="0" offset="0x1a8" instances="1" instaddr="4" internal="0" description="INTERNALTEST Node Control Register">
		<bitfield id="TESTSEL" description="Test Select" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="CONFIGLOCK" width="32" page="0" offset="0x1e8" instances="1" instaddr="4" internal="0" description="Lock Register for all the config registers.">
		<bitfield id="LOCKBIT" description="Locks analog subsystem config" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="AGPIOFILTER" description="Locks AGPIOFILTER Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="AGPIOCTRL" description="Locks all AGPIOCTRL Register" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="TSNSCTL" width="32" page="0" offset="0x1ec" instances="1" instaddr="4" internal="0" description="Temperature Sensor Control Register">
		<bitfield id="ENABLE" description="Temperature Sensor Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ANAREFCTL" width="32" page="0" offset="0x20c" instances="1" instaddr="4" internal="0" description="Analog Reference Control Register.">
		<bitfield id="ANAREFABSEL" description="Analog Reference ADC-A/B Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCDESEL" description="Analog Reference ADC-C/D/E Select" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFAB_2P5SEL" description="Analog Reference Select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCDE_2P5SEL" description="Analog Reference B Select" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="VREGCTL" width="32" page="0" offset="0x214" instances="1" instaddr="4" internal="0" description="Voltage Regulator Control Register">
		<bitfield id="PWRDNVREG" description="Power down internal voltage regulator" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ENMASK" description="Enable VMON function mask on a TRIM load" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="VMONCTL" width="32" page="0" offset="0x22c" instances="1" instaddr="4" internal="0" description="Voltage Monitor Control Register">
		<bitfield id="BORLVMONDIS" description="Disable BORL(ow) feature on VDDIO" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPHPMXSEL" width="32" page="0" offset="0x26c" instances="1" instaddr="4" internal="0" description="Bits to select one of the many sources on CopmHP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HPMXSEL" description="CMP1HPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2HPMXSEL" description="CMP2HPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3HPMXSEL" description="CMP3HPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4HPMXSEL" description="CMP4HPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="CMP5HPMXSEL" description="CMP5HPMXSEL bits" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="CMP6HPMXSEL" description="CMP6HPMXSEL bits" begin="17" end="15" width="3" rwaccess="RW"/>
		<bitfield id="CMP7HPMXSEL" description="CMP7HPMXSEL bits" begin="20" end="18" width="3" rwaccess="RW"/>
		<bitfield id="CMP8HPMXSEL" description="CMP8HPMXSEL bits" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="CMP9HPMXSEL" description="CMP9HPMXSEL bits" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="CMP10HPMXSEL" description="CMP10HPMXSEL bits" begin="29" end="27" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPHPMXSEL1" width="32" page="0" offset="0x270" instances="1" instaddr="4" internal="0" description="Bits to select one of the many sources on CopmHP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP11HPMXSEL" description="CMP11HPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP12HPMXSEL" description="CMP12HPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPLPMXSEL" width="32" page="0" offset="0x274" instances="1" instaddr="4" internal="0" description="Bits to select one of the many sources on CopmLP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LPMXSEL" description="CMP1LPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2LPMXSEL" description="CMP2LPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3LPMXSEL" description="CMP3LPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4LPMXSEL" description="CMP4LPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="CMP5LPMXSEL" description="CMP5LPMXSEL bits" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="CMP6LPMXSEL" description="CMP6LPMXSEL bits" begin="17" end="15" width="3" rwaccess="RW"/>
		<bitfield id="CMP7LPMXSEL" description="CMP7LPMXSEL bits" begin="20" end="18" width="3" rwaccess="RW"/>
		<bitfield id="CMP8LPMXSEL" description="CMP8LPMXSEL bits" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="CMP9LPMXSEL" description="CMP9LPMXSEL bits" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="CMP10LPMXSEL" description="CMP10LPMXSEL bits" begin="29" end="27" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPLPMXSEL1" width="32" page="0" offset="0x278" instances="1" instaddr="4" internal="0" description="Bits to select one of the many sources on CopmLP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP11LPMXSEL" description="CMP11LPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP12LPMXSEL" description="CMP12LPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPHNMXSEL" width="32" page="0" offset="0x27c" instances="1" instaddr="4" internal="0" description="Bits to select one of the many sources on CopmHN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HNMXSEL" description="CMP1HNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2HNMXSEL" description="CMP2HNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3HNMXSEL" description="CMP3HNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4HNMXSEL" description="CMP4HNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMP5HNMXSEL" description="CMP5HNMXSEL bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMP6HNMXSEL" description="CMP6HNMXSEL bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMP7HNMXSEL" description="CMP7HNMXSEL bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMP8HNMXSEL" description="CMP8HNMXSEL bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMP9HNMXSEL" description="CMP9HNMXSEL bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMP10HNMXSEL" description="CMP10HNMXSEL bits" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMP11HNMXSEL" description="CMP11HNMXSEL bits" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMP12HNMXSEL" description="CMP12HNMXSEL bits" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPLNMXSEL" width="32" page="0" offset="0x280" instances="1" instaddr="4" internal="0" description="Bits to select one of the many sources on CopmLN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LNMXSEL" description="CMP1LNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2LNMXSEL" description="CMP2LNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3LNMXSEL" description="CMP3LNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4LNMXSEL" description="CMP4LNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMP5LNMXSEL" description="CMP5LNMXSEL bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMP6LNMXSEL" description="CMP6LNMXSEL bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMP7LNMXSEL" description="CMP7LNMXSEL bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMP8LNMXSEL" description="CMP8LNMXSEL bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMP9LNMXSEL" description="CMP9LNMXSEL bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMP10LNMXSEL" description="CMP10LNMXSEL bits" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMP11LNMXSEL" description="CMP11LNMXSEL bits" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMP12LNMXSEL" description="CMP12LNMXSEL bits" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="LOCK" width="32" page="0" offset="0x294" instances="1" instaddr="4" internal="0" description="Lock Register">
		<bitfield id="TSNSCTL" description="TSNSCTL Register lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCTL" description="ANAREFCTL Register lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="VMONCTL" description="VMONCTL Register lock bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPHPMXSEL" description="CMPHPMXSEL Register lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPLPMXSEL" description="CMPLPMXSEL Register lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPHNMXSEL" description="CMPHNMXSEL Register lock bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPLNMXSEL" description="CMPLNMXSEL Register lock bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="VREGCTL" description="VREGCTL Register lock bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPHPMXSEL1" description="CMPHPMXSEL1 Register lock bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPLPMXSEL1" description="CMPLPMXSEL1 Register lock bit" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="IOMODESEL" width="32" page="0" offset="0x45c" instances="1" instaddr="4" internal="0" description="PMBUS IO Mode select register">
		<bitfield id="GPIO10" description="Mode select for GPIO10" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Mode select for GPIO15" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Mode select for GPIO18" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Mode select for GPIO22" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Mode select for GPIO23" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Mode select for GPIO29" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="AGPIOFILTER" width="32" page="0" offset="0x464" instances="1" instaddr="4" internal="0" description="AGPIO Filter Control Register">
		<bitfield id="FILTER" description="AGPIOFILTER Control for filter ALL AGPIO pins" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="AGPIOCTRLH" width="32" page="0" offset="0x48c" instances="1" instaddr="4" internal="0" description="AGPIO Control Register">
		<bitfield id="GPIO224" description="AGPIOCTRL for GPIO224" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="AGPIOCTRL for GPIO225" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="AGPIOCTRL for GPIO226" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="AGPIOCTRL for GPIO227" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="AGPIOCTRL for GPIO228" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="AGPIOCTRL for GPIO229" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="AGPIOCTRL for GPIO230" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="AGPIOCTRL for GPIO231" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="AGPIOCTRL for GPIO232" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="AGPIOCTRL for GPIO233" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="AGPIOCTRL for GPIO234" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="AGPIOCTRL for GPIO235" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="AGPIOCTRL for GPIO236" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="AGPIOCTRL for GPIO237" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="AGPIOCTRL for GPIO238" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="AGPIOCTRL for GPIO239" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="AGPIOCTRL for GPIO240" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="AGPIOCTRL for GPIO241" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="AGPIOCTRL for GPIO242" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO243" description="AGPIOCTRL for GPIO243" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="AGPIOCTRL for GPIO244" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="AGPIOCTRL for GPIO245" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO246" description="AGPIOCTRL for GPIO246" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO247" description="AGPIOCTRL for GPIO247" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO248" description="AGPIOCTRL for GPIO248" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO249" description="AGPIOCTRL for GPIO249" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="PARITY_TEST" width="32" page="0" offset="0x4b4" instances="1" instaddr="4" internal="0" description="Enables parity test">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
